Examples/Lookups/Internal Id to Apexa Id Request.xml

<soapenv:Envelope xmlns:apex="http://schemas.datacontract.org/2004/07/Apexa.CITS.WCF.DataContracts"
  xmlns:ns="http://ACORD.org/Standards/Life/2"
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
      xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <wsse:UsernameToken wsu:Id="UsernameToken-58C7E4AD6FAB7DD487165479597079815">
        <wsse:Username>INSERT_USERNAME</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">INSERT_PASSWORD</wsse:Password>
        <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">y/6I9VINoekA8cnapXZ3ww==</wsse:Nonce>
        <wsu:Created>2022-06-09T17:32:50.798Z</wsu:Created>
      </wsse:UsernameToken>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <ns:ProcessNonCITSMessage>
      <ns:request>
        <apex:id>xyz2015</apex:id>
        <apex:requestType>RequestContractorApexaIds</apex:requestType>
      </ns:request>
    </ns:ProcessNonCITSMessage>
  </soapenv:Body>
</soapenv:Envelope>